{"key":"om-oss","text":"Nyfiken På We Know IT? | Om Oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Varför We Know IT? Vi är IT-konsultbolaget som satsar på studerande och nyexade talanger med höga ambitioner och drivkrafter. Experter på utveckling, design och digital strategi, We Know IT helt enkelt. ​Mål, vision & sådant gött Vårt mål är att vara det självklara valet för studenter att starta sin karriär på, och det självklara valet för företag som behöver motiverad och innovativ kompetens. Det är inte alla som får chansen att jobba med morgondagens skarpaste konsulter. Vi får det varje dag, och du som kund eller samarbetspartner får stora möjligheter genom att välja oss. Vi vill ha kul på vägen och leverera över förväntan så ofta som möjligt. Det gör vi genom att vara lyhörda, ha öppen kommunikation och starka relationer. Vi ger våra WKITare frihet och tror på varje persons förmåga att lösa utmaningar på bästa sätt. Dessutom är vi helt digitala, vilket möjliggör för oss att knyta kontakter runt om i hela Sverige. Vi värdesätter att ge frihet åt våra konsulter och att hjälpa dem uppnå sina mål i början på karriären. anställda 60+ Levererade projekt\/år 100+ tech 100% Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down bars linkedin angle-down ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/om-oss\/","category":"general"}
{"key":"karriar","text":"Karriar | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Bli en del av vår framgångssaga. Vi har anställningsmöjligheter som passar alla, vare sig du söker heltid, deltid eller frilansarbete. Lediga tjänster Spontanansökan Lediga tjänster Spontanansökan Läs Mer >>> UX\/UI-designer\/Frontend developer Som Designer\/frontend-utvecklare får du möjligheten att arbeta med spännande projekt där du ansvarar för att leverera projekt åt våra kunder. Läs Mer >>> Talent Manager Som Talent Manager arbetar du nära våra konsulter och medarbetare med fokus på vår rekrytering och personalhantering (första kontakten till folk som söker jobb). Läs Mer >>> Skicka in en spontanansökan! Vi uppmuntrar dig att skicka in en spontanansökan om du är intresserad av att bli en del av vårt team. Hos oss ser vi på spontanansökningar som ett sätt för dig att visa ditt intresse för vårt företag, även om vi för tillfället kanske inte har specifika tjänster öppna. Din ansökan kommer att granskas noggrant, och om den matchar våra framtida behov kommer vi att höra av oss. Vi värdesätter engagemang och passion för det vi gör, och vi ser fram emot att lära känna dig och ditt professionella intresse. hello@weknowit.se Recruitment form Text Input Text Input Vilken region tillhör du? Välj vilken region som passar bäst! Stockholm Göteborg Östergötland Skåne Umeå Luleå Centralt Sverige Annan Länk Ladda upp ditt cv Välj fil Jag godkänner villkoren i We Know IT:s personuppgiftspolicy . Tillbaka Skicka in ​Mål, vision & sådant gött Vårt mål är att vara det självklara valet för studenter att starta sin karriär på, och det självklara valet för företag som behöver motiverad och innovativ kompetens. Det är inte alla som får chansen att jobba med morgondagens skarpaste konsulter. 01 WKITare​ Perks På We Know IT får man chansen att utvecklas både personligt, men framför allt i sin roll och kompetens. Våra konsulter och anställda har frihet att ta egna initiativ, eget ansvar och har dessutom möjligheten att jobba helt remote. Hos oss får man jobba med andra innovativa och drivna unga talanger inom flera områden. Det vi alla har gemensamt är att vi älskar tech och viljan att växa tillsammans. 02 Hela Sveriges talangfabrik Vi är inte som alla andra. Vi anställer de *klichévarning (men sanning)* mest drivna, motiverade och nybakade (även om de inte är klara i ugnen än) talangerna i Sverige. Studenterna, och de nyexade, som är mer taggade än någon annan att programmera, designa, marknadsföra och projektleda. När andra letar efter erfarenhet letar vi efter motivationen. Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down bars linkedin angle-down ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/karriar\/","category":"general"}
{"key":"konsultuthyrning","text":"Konsultuthyrning | Din Framtida Talang | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Konsultuthyrning. Din framtida Vi har sedan 2008 sökt och utvecklat topptalanger inom IT för att driva digitaliseringen. Vi erbjuder våra konsulter för uthyrning med möjlighet till en permanent anställning \"try & hire\". Kontakta oss Möjligheternas land. Vare sig ni står inför ett kort- eller långsiktigt behov är vi övertygade om att vi har den rätta lösningen för er. Med vår expertis och flexibilitet kring både heltids- och deltidskonsulter är vi redo att skräddarsy en lösning som passar just era unika krav och mål. Låt oss ta hand om era digitala behov och säkerställa er framgång! 01 Våra områden Vi erbjuder en rad olika specialiseringar och kompetenser inom IT-konsultation, allt från tekniska genier till kreativa visionärer. Våra talanger finns tillgängliga för att uppfylla ert företags unika behov. Oavsett om det gäller att förbättra en befintlig webbplats eller att skapa en helt ny kommunikationsplattform står vårt skickliga team av utvecklare, designers och digitala marknadsförare redo att leverera innovativa och skräddarsydda lösningar. Vi hyr ut talanger inom följande områden: - Webbutveckling (JavaScript, React.js, Flutter, PHP, WordPress, WooCommerce, Shopify, WebFlow, Next.js, Node.js) - Apputveckling (React Native, Flutter, Swift, Kotlin) - Cloud & Hosting (AWS, Google Cloud, Loopia, One) - Projektledning & verksamhetsutveckling - Dataanalys - UX\/UI-Design - Digital Marknadsföring (SEO, SEM, Paid Social, Content Marketing) 02 Hyr en IT-konsult Våra IT-konsulter är mer än bara experter - de är dina partners, bollplank och ditt hemliga vapen för att ta din verksamhet till nya höjder. Med en mångfald av färdigheter och erfarenheter fungerar de som integrerade teammedlemmar, strategiska navigatörer och problemlösare. Oavsett om du behöver en permanent närvaro, extra stöd under en särskild period eller en pålitlig partner för löpande projekt, erbjuder vi flexibla avtal som passar dina behov och mål perfekt. En av de unika fördelarna med att använda We Know IT är vår förmåga att samarbeta och stötta varandra inom firman. En uthyrd konsult har tillgång till hela bolagets kompetens och kan därmed enkelt be om stöd och lösa uppgifter effektivt. Med detta arbetssätt och samarbete får ni tillgång till en bredare och djupare expertis än genom traditionell rekrytering. Genom att gifta ihop er djupa verksamhetsförståelse med våra konsulters specialkunskaper inom områden som webbutveckling, digital marknadsföring och UX-design finns det mycket goda förutsättningar för ett lyckat projekt! 03 Try & Hire Våra kunder förtjänar en långsiktig och pålitlig lösning för att tillgodose sina kontinuerliga IT-kompetensbehov, och vår 'Try & Hire'-modell är svaret många letar efter. We Know IT är en samarbetspartner som står ut från mängden. Vår unika metodik fokuserar på att snabbt integrera våra talanger i era kritiska digitala områden. I takt med att konsulten blir insatt i våra kunders verksamhet och kunderna får testa konsultens alla färdigheter erbjuds också möjligheten till en permanent rekrytering över tid om det önskas. Detta upplägg skapar största möjliga värde för alla parter och ger våra kunder access till en väl kurerad talangpool direkt från toppuniversitet som annars är svårtillgänglig. Vårt mål är att erbjuda marknadens bästa IT-talanger på ett enkelt och prisvärt sätt. Med en imponerande track record av anställda och alumnis är vi övertygade om att ni kommer hitta er nästa stjärna hos oss, redo att driva den digitala utvecklingen inom ert företag till nya höjder. Kika gärna in vårt urval av alumner nedan! Alumner. Tidigare talanger hos oss, som nu gör skillnad hos företag. Tobias Altehed Head of Digital Core, Volvo Cars Frida Andersson Data Scientist, Silo AI Olivia Lund Product Manager, Boulder Ruben Lindström Senior Engineer, Spotify Iris Kotsinas Software Engineer, EA Dice Lina Ward Digital Marketer, Headbrands Leonard Hedenblad Strategy, Einride Annika Lundberg UX\/UI-designer, Enpal Cornelia Holm Project Manager, Ellevio Vad kan vi göra för dig? Ta kontakt med oss idag så bygger vi ditt framtida team tillsammans! Skicka förfrågan Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB envelope-o close arrow-circle-o-down phone bars linkedin angle-down ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/tjanster\/konsultuthyrning\/","category":"services"}
{"key":"webbutveckling","text":"Webbutveckling För Företag & Organisationer | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Webbutveckling. För oss på We Know IT är webbsidor och digitala plattformar mer än bara kod – de är affärskritiska gränssnitt som skapar konkreta affärer såväl som identitet för ert företag. Vi är redo att ta er digitala närvaro till nästa nivå! Skräddarsydd När målet är att ta över världen och det inte duger med \"lagom\" längre. Då skräddarsyr vi er webbsida eller plattform med hjälp av ramverk som React.js, Next.js m.m. Wordpress \"Klassikern\" som vägrar att gå ur tiden. Med ett enormt community som håller CMS:et fräscht är WordPress väl rustat för att möta de flesta teknologiska behoven. WebFlow Utmanaren som är yngre, modernare och något förenklad. När design och utseende är viktigare än tunga funktioner är WebFlow ett pålitligt alternativ. Kontakta oss Oändliga möjligheter. På We Know IT är vår strävan att erbjuda prisvärda och professionella tjänster inom webbutveckling. Genom att kombinera avancerad teknik med en pedagogisk metodik löser vi alla typer av tekniska utmaningar, oavsett om de är små eller stora. Vi tar oss tid att lyssna på era behov och önskemål för att hitta den optimala plattformen för ert företag. Vid behov utvecklar vi skräddarsydda lösningar som överträffar era förväntningar och krav. Vår framgång mäts i kvaliteten på vårt arbete, hög kundnöjdhet och användarvänlighet. Hos oss kan du alltid förvänta dig högkvalitativa och kostnadseffektiva resultat. 01 Landningssida En landningssida är avgörande för att skapa ett starkt första intryck online, etablera trovärdighet och ge enkel tillgång till viktig information. Den fungerar som en kostnadseffektiv marknadsföringsplattform och driver önskade handlingar från besökare. En välutformad landningssida är nyckeln till framgångsrik digital närvaro. 02 E-handel och marketplace Rätt utformad blir e-handeln ett affärskritiskt showroom och konverterande butik för era produkter och tjänster. Förmågan att ge kunderna bekväm tillgång till hela ert produkt- och tjänstesortiment var som helst ifrån är idag en avgörande motor i affären. Tillsammans med exempelvis tillgång till recensioner, betyg och kampanjer sänks tröskeln för köp. 03 Bokningssystem Ett bokningssystem på din webbsida ökar tillgängligheten för kunder, gör bokningsprocessen smidig och sparar tid för både er och kunderna. Det ger också möjlighet att effektivt hantera resurser, minimera överbokning och öka konverteringarna, vilket resulterar i en mer organiserad och framgångsrik verksamhet. 04 Ärendehantering Ett ärendehanteringssystem, exempelvis i samband med kontaktformulär, effektiviserar hanteringen av ärenden och kontaktförfrågningar i er verksamhet. Det organiserar och spårar ärenden, minimerar svarstider och skapar strukturerad kommunikation. Genom att centralisera ärenden och förfrågningar främjas effektivitet, vilket resulterar i ökad produktivitet, konvertering och bättre service. 05 Intranät & adminportaler Ett intranät och en adminportal fungerar som centrala nav för intern informationsdelning och administrativa uppgifter. De ökar effektiviteten genom att ge anställda en enkel åtkomstpunkt för resurser, dokument och verktyg. Genom att centralisera administrationen förenklas processer, vilket leder till ökad produktivitet och bättre samarbete inom organisationen. 06 Portfölj & galleri En portfölj eller ett galleri på din webbplats fungerar som en visuell presentation av ert företag, arbete, projekt eller konst. Det ger en imponerande överblick, ökar synligheten och stärker er professionella image. Genom att skapa en översiktlig och engagerande portfölj, kan ni effektivt visa upp er kompetens och locka intresse från potentiella kunder eller samarbetspartners. Innovativa projektexempel. Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och webbsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. - - Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. Wängkraft Solcellsrådgivare webbsida och bokningssystem. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och hemsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. Vad kan vi göra för dig? Vi hjälper med att förverkliga er idé och förbättra er digitala närvaro. Låt oss skapa framtiden tillsammans! Skicka förfrågan Utvecklingsprocessen. 1. Start Vi bjuder in er till ett uppstartsmöte där vi på djupet går igenom era affärsbehov och mål med er webbsida och digitala närvaro, för att tillsammans skapa kreativa lösningar som hjälper er att nå affärsmål. 2. Förstudie & sitemap Efter uppstartsmötet definieras webbsidans struktur och funktionalitet upp utifrån era affärsbehov. I detta arbete kliver våra SEO (Search Engine Optimization) -magiker in i handling. Genom att fördjupa sig i en detaljerad sökordsanalys formulerar hen en strukturerad plan för den kommande webbplatsen, en så kallad ”sitemap”. 3. Design När vi har den fasta strukturen för er webbplats på plats, kastar vi oss in i designfasen med fullt fokus på användarupplevelse (UX) - hur vi kan göra det bästa möjliga för era besökare och öka konverteringen. 4. Utveckling I kreativa möten hos We Know IT samlas produktionsledare, designer och utvecklare för att säkerställa en effektiv utvecklingsfas av webbsidan. Vi använder vårt unika ramverk för att säkerställa högsta kvalitet och kontinuerlig rapportering. 5. Innehåll I samband med webbutveckling uppstår ofta behovet av nytt innehåll. Vi lägger stor vikt vid att SEO-anpassa alla texter i termer av sökordsdensitet, ordmängd och kvalitet. 6. Kvalitetssäkring & lansering När webbutvecklingen är färdig och det nya innehållet har integrerats är det dags för det avslutande sluttestet av webbplatsen. Vi följer noggrant ett testprotokoll som är utformat för att säkerställa den höga kvaliteten på våra produkter. När sidan passerat tester lanseras den och börjar skapa värde och konvertera nya affärer för er! 7. Support, marknadsföring och uppdateringar Efter lansering följer ett arbete där vi gärna hjälper er att få bästa effekt av sidan genom anpassad digital marknadsföring, support och uppdateringar utifrån behov. Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB envelope-o close arrow-circle-o-down phone flask bars linkedin angle-down code code-fork ellipsis-v check-square file-text instagram wordpress paint-brush line-chart sticky-note icons8-webflow","url":"https:\/\/www.weknowit.se\/tjanster\/webbutveckling\/","category":"services"}
{"key":"apputveckling","text":"Apputveckling | Vi Bygger Er App | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Apputveckling. I en värld där appar dominerar varje telefon, förstår vi vikten av kvalitet och räckvidd. Med vår expertis i kostnadseffektiv apputveckling och appdesign för både Android och iOS, tar vi er vision till verklighet. Mobilapplikation Vi bygger native appar för specifika operativsystem som utnyttjar enhetens hårdvara fullt ut, samt hybridappar som bygger på en universell kodbas som smidigt anpassar sig för både iOS och Android Webbapplikation Progressiva webbappar (PWAs) erbjuder en sömlös hybrid mellan en webbplats och en mobilapp, med förmågan att fungera offline. Dessa appar ger universell tillgång oavsett enhet eller internetanslutning Systemapplikation Upptäck systemappar designade för att kraftfullt stödja ditt företags processer. Skräddarsydda för djupgående integration, de levererar omfattande lösningar som förvandlar verksamheten. Kontakta oss Värde för användarna. Bakom varje toppenapp finns en massa hårt jobb och smart tänk. Vi är här för att hjälpa till att göra din idé till en app som inte bara ser bra ut, men som också funkar utan strul. Vi lyssnar på vad du behöver och använder vår kunskap för att bygga något som fungerar överallt, oavsett om man använder telefon eller dator. Vi jobbar tillsammans med dig för att se till att appen blir precis som du vill ha den. Låt oss ta din idé och göra den till en app som folk kommer att älska att använda. Nedan följer fler insikter hur vi förhåller oss till apputveckling. 01 Skräddarsydda applikationer I en värld där varje företag är unikt, förstår vi på We Know IT vikten av att ha skräddarsydda applikationer som exakt matchar dina specifika behov och mål. Vi erkänner de utmaningar och möjligheter som din verksamhet står inför och är dedikerade till att skapa anpassade lösningar som inte bara löser dina omedelbara problem utan också är skalbara för att växa med dig. Vår passion ligger i att förvandla dina unika krav till verklighet genom teknik som skapar maximalt värde för användarna. Med en djupgående förståelse för den senaste tekniken och en kreativ problemlösningsteknik, strävar vårt team efter att leverera högkvalitativa, användarvänliga och effektiva applikationer som stärker din verksamhet. Hos We Know IT förstår vi att de applikationer vi utvecklar ofta spelar en central roll i våra kunders verksamheter. Därför är vårt fokus inte bara på att skapa skräddarsydda lösningar som möter unika behov, utan också på att leverera robusta och pålitliga system som är avgörande för företagets framgång. Vårt engagemang ligger i att bygga applikationer som inte bara är skalbara och värdeskapande för användarna, utan som också blir en kritisk del i att driva verksamheten framåt. 02 Multiplattformsutveckling I den digitala eran är det viktigare än någonsin att din applikation är tillgänglig och fungerar felfritt över en mängd olika enheter och operativsystem, inklusive iOS och Android. Hos oss på We Know IT behärskar vi konsten att skapa multiplattformsapplikationer som inte bara möter denna standard, utan även smidigt integreras med dina befintliga lösningar. Vi förstår vikten av en sömlös användarupplevelse och strävar efter att leverera skräddarsydda applikationer som fungerar överallt – från smartphones till surfplattor och datorer. Låt oss hjälpa dig att bygga de robusta och flexibla lösningarna ditt företag behöver för att lyckas i en alltmer uppkopplad värld. 03 Branschspecifika applikationer Hos We Know IT har vi solid erfarenhet av att jobba med applikationer som är skräddarsydda för olika branscher. Vi förstår hur olika varje företags behov kan vara och jobbar nära dig för att bygga lösningar som verkligen passar din verksamhet. Vårt team är van vid att hantera både de tekniska och specifika utmaningarna inom olika sektorer, från finans och hälsovård till utbildning. Med We Know IT får du inte bara en leverantör, utan en partner som är engagerad i att göra ditt företag mer effektivt och konkurrenskraftigt. Låt oss hjälpa dig att ta nästa steg framåt med applikationer som gör skillnad. Exempel på branscher som vi tidigare levererat applikationer till: - Hälsovård - Fastigheter - Transport och Logistik - Detaljhandel och E-handel - Underhållning och Media - Dagligvaruhandel - Tillverkningsindustrin - Offentlig sektor - Ideella organisationer - Turism och gästfrihet 04 Spelutveckling Förvandla din spelidé till nästa stora hit med vårt specialiserade team inom spelutveckling och speldesign, inklusive leveldesign. Hos oss möts passion för spel med teknisk expertis för att skapa djupt engagerande och visuellt imponerande spelupplevelser. Vårt dedikerade team av utvecklare, designers och kreatörer arbetar hand i hand för att säkerställa att varje aspekt av ditt spel – från karaktärsutveckling till de mest komplexa spelvärldarna – är genomtänkt och välutformad. Vi använder den senaste tekniken för att ge liv åt dina mest ambitiösa projekt, oavsett genre eller plattform. Tillsammans skapar vi inte bara spel, vi skapar världar där spelare kan förlora sig, utmanas och triumfera. Gör din vision till verklighet och sätt en ny standard inom spelindustrin med oss. Låt oss leda vägen till framgång i den spännande världen av spelutveckling! 05 Teknologier Inom apputveckling finns det en rad teknologier och verktyg som används beroende på projektets krav, målgrupp och plattform. Här är några av de vanligaste teknologierna vi använder: Programmeringsspråk: För native iOS-appar: Swift. För native Android-appar: Kotlin och Java. Cross-platform utvecklingsverktyg: Dessa teknologier möjliggör utveckling av appar som kan köras på flera plattformar från en enda kodbas. De mest populära inkluderar: - React Native (använder JavaScript) - Flutter (använder Dart) - Webbaserade teknologier för - Progressive Web Apps (PWAs): HTML5, CSS3 och JavaScript är grundstenarna för att skapa PWAs som kan leverera en app-liknande upplevelse i en webbläsare. Backend-utveckling: För att hantera databaser, serverlogik och integrationer med andra tjänster använder utvecklare ofta: - Node.js - Django (Python) - .NET (för C#) Databas teknologier: För att lagra data använder appar olika databaser. Några populära val inkluderar: - Firebase (erbjuder även andra utvecklingsverktyg) - MongoDB - PostgreSQL - MySQL Utvecklingsmiljöer och verktyg: Integrated Development Environments (IDEs) och andra verktyg: - Xcode för iOS-utveckling - Android Studio för Android-utveckling - Visual Studio Code, som kan användas för både frontend och backend samt för cross-platform utveckling. Versionshanteringssystem: Git är det mest använda systemet för versionshantering, vilket är avgörande för att hantera kodbaser, samarbete och spårning av ändringar i utvecklingsprojekt. Cloud-tjänster och API:er: För att utöka funktionaliteten i appar och underlätta skalbarhet integreras ofta tjänster som AWS (Amazon Web Services), Google Cloud Platform och Microsoft Azure, tillsammans med olika tredjeparts-API:er. Innovativa projektexempel. Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och webbsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. - - Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. Wängkraft Solcellsrådgivare webbsida och bokningssystem. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och hemsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. Vad kan vi göra för dig? Tillsammans skapar vi en digital närvaro som sticker ut och skapar värde för era användare! Skicka förfrågan Utvecklingsprocessen. 1. Start Vi välkomnar er till ett inledande möte där vi noggrant utforskar era kommersiella ambitioner och syften med er app samt digitala fotavtryck. Genom detta samarbete syftar vi till att utforma innovativa lösningar som stödjer er i att uppnå era affärsstrategier. 2. Förstudie & användarflöde I apputveckling är ett genomtänkt användarflöde essentiellt för intuitiv navigering och en sömlös användarupplevelse. Det hjälper utvecklare att förstå appens struktur och de funktioner som krävs, säkerställer att varje användarsteg är logiskt, och bör vara en av de första stegen i utvecklingsprocessen för en effektiv interaktionsdesign. 3. Appdesign När den stadiga arkitekturen för er app är fastställd, ger vi oss helt in i designstadiet med ett skarpt fokus på användarupplevelsen (UX). Vårt driv är att finjustera användarnas engagemang för att skapa maximalt värde för användarna. 4. Utvecklingsfasen På We Know IT träffas projektledare, designers och utvecklare för att effektivisera apputvecklingen. Vi använder vårt ramverk för att hålla hög kvalitet och ge regelbundna uppdateringar. 5. Implementation På We Know IT stöttar vi våra kunder genom hela processen att implementera appen i deras verksamhet, användandes beprövade metoder som workshops eller utbildningar. 6. Kvalitetssäkring & lansering När apputvecklingen är slutförd och alla funktioner har integrerats, är det dags för det avgörande sluttestet av appen. Vi följer ett detaljerat testprotokoll, skräddarsytt för att garantera den höga standarden på våra leveranser. Efter att appen har klarat alla tester, lanseras den för att börja generera värde för användarna. 7. Vidareutveckling, support och uppdateringar Efter lanseringen fortsätter vårt arbete där vi är redo att stödja er med vidareutveckling, support och uppdateringar anpassade efter era behov för att maximera appens prestanda och värde. Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB envelope-o close arrow-circle-o-down random phone flask bars linkedin angle-down mobile code-fork ellipsis-v check-square file-text instagram paint-brush line-chart sticky-note display","url":"https:\/\/www.weknowit.se\/tjanster\/apputveckling\/","category":"services"}
{"key":"design","text":"Design | UX\/UI | Grafisk Design | Designprototyper | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss UX\/UI-Design. Våra exklusiva designlösningar ger dig användare som stannar kvar, inte bara tittar förbi! KONTAKTA OSS Visualisera dina idéer. Välkommen till en värld där form möter funktion, och kreativitet är nyckeln till varje framgångsrik produkt. Vi är passionerade för design och drivs av en önskan att skapa upplevelser som överträffar förväntningarna. Med en kombination av estetik och användbarhet formar vi inte bara produkter - vi formar livsstilar och förändrar hur människor interagerar med världen omkring dem. Oavsett om du behöver design för en produkt, en webbplats, eller en upplevelse, är vi här för att göra din vision till verklighet. Med vår passion och kompetens för design kan vi hjälpa dig att skapa något extraordinärt, något som inte bara imponerar utan också inspirerar. Kontakta oss idag och låt oss tillsammans skapa något magiskt. 01 Designprototyp Vår passion för innovation och vårt engagemang för att leverera högkvalitativa designprototyper är vad som skiljer oss från resten. Varje steg i vår process är noggrant genomtänkt för att säkerställa att varje detalj i din produktprototyp inte bara fångar intresse utan också inspirerar förtroende hos dina potentiella kunder och investerare. Vi förstår djupgående vikten av att skapa prototyper som inte bara är visuellt tilltalande utan också praktiskt användbara och effektiva. Vår erfarna designteam kombinerar kreativitet med teknisk expertis för att skapa prototyper som inte bara imponerar utan också levererar på funktionalitet. Varje knapptryck, varje interaktion är utformad för att ge en smidig och tillfredsställande användarupplevelse, vilket i sin tur bygger upp förtroende och lojalitet gentemot din produkt. Med våra designprototyper kan du vara säker på att din produkt kommer att göra ett bestående intryck på marknaden. Vi går bortom det visuella och gräver djupt in i användarupplevelsen för att säkerställa att din produkt inte bara sticker ut utan också uppfyller och överträffar förväntningarna. Varje funktion, varje detalj är avsedd att bidra till att skapa en produkt som inte bara löser ett problem utan också gör det på ett sätt som är intuitivt och tillfredsställande för användaren. 02 Grafisk Design Skapa ett varumärke som inte bara ses – det upplevs. Vi skapar logotyper som bränner sig fast i minnet och reklammaterial som skapar buzz. Från minnesvärda logotyper till reklammaterial som väcker uppmärksamhet – vi levererar design som gör skillnad. En välutformad grafisk design hjälper till att kommunicera budskap på ett tydligt och effektivt sätt. Vårt mål är att leverera grafisk design som bidrar till att ert företag når sina mål och bygger starka relationer till kunder. Vårt designteam är redo att ta din vision och förvandla den till en levande grafisk berättelse. Med en djup förståelse för designens betydelse för varumärkesbyggande och kommunikation, tar vi varje projekt till nästa nivå med innovativa koncept och omsorgsfullt utformade detaljer. Låt oss tillsammans skapa grafisk design som inte bara är vacker utan också effektiv och minnesvärd. 03 User Experience Design Upptäck UX-design som förvandlar varje swipe till en wow-upplevelse! Vi skapar digital magi där varje pixel räknas och varje klick leder till konversion. Dina användare förtjänar en hemsida värd att återkomma till – och vi är här för att designa varje steg på den vägen. Genom att lyssna på dina behov och förstå din målgrupp kan vi skapa UX-design som verkligen gör skillnad för ditt varumärke. Vi strävar efter att skapa användarupplevelser som inte bara är effektiva i att lösa problem utan också lämnar ett varaktigt intryck hos användarna. Oavsett om det är genom intuitiva gränssnitt, engagerande interaktioner eller nyskapande designelement, är vår målsättning att göra varje användarupplevelse minnesvärd och meningsfull. Med våra skräddarsydda UX-designlösningar kan du vara säker på att din produkt eller tjänst inte bara kommer att fungera bra, utan också skapa en stark koppling med din målgrupp. Vi är här för att hjälpa dig att förändra spelplanen och ta din användarupplevelse till nästa nivå. Låt oss tillsammans skapa en UX-design som verkligen gör skillnad och tar ditt varumärke till nya höjder av framgång. Innovativa projektexempel. Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och webbsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. - - Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. Wängkraft Solcellsrådgivare webbsida och bokningssystem. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och hemsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. Från idé till verklighet. Vi tar abstrakta idéer till verklig design. Kontakta oss idag för att få skräddarsydda designlösningar! Skicka förfrågan Designprocessen. 1. Upptäck Vi börjar med att förstå dina behov, mål och utmaningar. Vi konsulterar också om eventuella specifika önskemål och begränsningar, inklusive nivån av WCAG (Web Content Accessibility Guidelines) som ska upprätthållas. 2. Precisera I steg två skapar vi en sitemap och personas utifrån insamlade geografiska och demografiska data. Det ger oss klarhet om målgruppen. Vi utför även en konkurrensanalys för att säkerställa att er webbplats sticker ut och är användarvänlig. 3. Wireframes I produktionen av er digitala resurs börjar vi med att skapa wireframes för att definiera strukturen. Sedan tar vi fram den visuella designen och skapar en prototyp för att testa funktioner och design. 4. Leverans När både ni och vi är nöjda med webbplatsen och designen har godkänts, levererar vi high-fidelity skisser redo för implementering av en utvecklare. Vi tillhandahåller också riktlinjer för användning av designelement som fonter, ikoner och färger. 5. Test Vi genomför användartester där verkliga användare interagerar med er design för att identifiera eventuella utmaningar och möjligheter till förbättring. Med insikterna från dessa tester kan vi finjustera och optimera designen för att säkerställa att den uppfyller era användares behov och förväntningar på bästa möjliga sätt. 6. Iterativ process Efter feedback från verkliga användare upprepas processen igen i en så kallad iterativ process för att bygga vidare och förbättre designen. Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB envelope-o heart th-large close arrow-circle-o-down refresh pencil comments phone bars linkedin lightbulb-o angle-down ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/tjanster\/design\/","category":"services"}
{"key":"digital-marknadsforing","text":"Digital Marknadsföring | Maximera Din Synlighet | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Digital Marknadsföring. Maximera din synlighet online med skräddarsydd digital marknadsföring. Nå din målgrupp effektivt och öka dina konverteringar. Börja idag! Kontakta oss Väx dina affärer. På We Know IT är vår strävan att erbjuda prisvärda och professionella tjänster inom digital marknadsföring. Genom att kombinera avancerad teknik med en pedagogisk metodik löser vi alla typer av tekniska utmaningar, oavsett om de är små eller stora. Vi tar oss tid att lyssna på era behov och önskemål för att hitta den optimala plattformen för ert företag. Vid behov utvecklar vi skräddarsydda lösningar som överträffar era förväntningar och krav. Vår framgång mäts i kvaliteten på vårt arbete, hög kundnöjdhet och användarvänlighet. Hos oss kan du alltid förvänta dig högkvalitativa och kostnadseffektiva resultat. 01 Sökoptimering - SEO Sökmotoroptimering (SEO) är en grundsten i digital marknadsföring som fokuserar på att förbättra din webbplats synlighet i sökmotorernas organiska (icke-betalda) sökresultat. Genom effektiv SEO kan ditt företag uppnå högre placeringar på sökresultatsidorna (SERP), vilket ökar chansen att potentiella kunder hittar dig när de söker efter produkter eller tjänster som du erbjuder. SEO omfattar en rad tekniker och strategier, inklusive sökordsanalys, innehållsoptimering, teknisk SEO, och att bygga kvalitativa inkommande länkar, allt för att göra din webbplats mer attraktiv för sökmotorer som Google. En väl genomförd SEO-strategi leder inte bara till ökad trafik utan bidrar även till att förbättra användarupplevelsen på din webbplats. Det innebär att arbeta med webbplatsens laddningstider, mobilanpassning och strukturen på innehållet för att göra det lättläst och navigerbart för både användare och sökmotorernas robotar. Genom att fokusera på användarens intentioner och erbjuda värdefullt, relevant och engagerande innehåll kan ditt företag bygga auktoritet och trovärdighet inom din bransch. Investera i SEO är en långsiktig strategi som kan ge betydande avkastning över tid. Till skillnad från betalda annonser, där trafiken upphör när du slutar betala, kan de positiva effekterna av SEO-arbete bestå och fortsätta att generera värde långt efter det initiala arbetet är gjort. Om du vill säkra en konkurrenskraftig position i den digitala världen, är sökoptimering ett måste. Låt SEO vara din guide till ökad synlighet, bättre användarupplevelse och slutligen mer framgångsrika affärsresultat. 02 Google Ads - SEM Google Ads är en kraftfull plattform för sökmotormarknadsföring (SEM) som erbjuder företag av alla storlekar en unik möjlighet att nå ut till potentiella kunder just när de söker efter produkter eller tjänster som ditt företag erbjuder. Med Google Ads kan du skapa riktade annonser som visas på Googles sökresultatsidor och på andra webbplatser inom Googles nätverk. Det unika med Google Ads är dess förmåga att erbjuda hög precision i målgruppsriktningen, vilket innebär att dina annonser kan skräddarsys för att nå specifika geografiska områden, sökord, enhetstyper och mycket mer. En av de stora fördelarna med Google Ads och SEM är att du betalar per klick (PPC), vilket innebär att du endast betalar när någon faktiskt klickar på din annons. Detta gör det till ett kostnadseffektivt sätt att driva relevant trafik till din webbplats. Dessutom ger Google Ads dig detaljerad insikt om hur väl dina annonser presterar, så att du kan justera och optimera dina kampanjer för bättre resultat över tid. Oavsett om ditt mål är att öka webbplatstrafiken, generera leads eller öka försäljningen, kan Google Ads och SEM hjälpa dig att nå dina affärsmål genom att placera ditt varumärke framför rätt människor vid rätt tillfälle. Investera i Google Ads idag för att ta din digitala marknadsföring till nästa nivå och se ditt företag växa. 03 Sociala Medier Marknadsföring och hantering av sociala medier är en dynamisk och kritisk del av den moderna digitala marknadsföringsstrategin, vilket möjliggör för företag att engagera sig direkt med sina målgrupper där de spenderar en stor del av sin tid online. Sociala medieplattformar som Facebook, Instagram, Twitter, LinkedIn och TikTok erbjuder unika möjligheter att bygga varumärkesmedvetenhet, främja kundlojalitet och öka försäljningen genom målinriktad och kreativ kommunikation. Genom att skapa och dela engagerande innehåll kan företag etablera meningsfulla relationer med sina följare, samtidigt som de samlar värdefulla insikter om deras beteenden och preferenser. Effektiv hantering av sociala medier kräver en strategisk tillvägagångssätt, inklusive planering av innehållskalendrar, utveckling av innehåll som resonerar med målgruppen, och regelbunden interaktion genom kommentarer och meddelanden för att främja en känsla av gemenskap och tillhörighet. Dessutom är betald annonsering på sociala medier ett kraftfullt verktyg för att nå ut till specifika demografiska segment med precisionsriktad marknadsföring, vilket ytterligare förbättrar synligheten och engagemanget. Analys och utvärdering spelar också en central roll i framgången för sociala medier. Genom att noggrant övervaka prestanda och engagemangsdata kan företag justera sina strategier i realtid för att maximera ROI. Att lyssna på och engagera sig i konversationer kring ditt varumärke på sociala medier ger dessutom ovärderliga insikter i kundernas åsikter och förväntningar. I en värld där digital närvaro är avgörande, är marknadsföring och hantering av sociala medier inte längre ett alternativ utan ett måste för företag som siktar på att växa och engagera sig med sin målgrupp på ett meningsfullt sätt. Genom att investera i sociala medier kan företag förbättra sin varumärkesposition, driva trafik och konverteringar, samt bygga starka, långvariga relationer med sina kunder. 04 Konverteringsoptimering Konverteringsoptimering är en avgörande komponent i digital marknadsföring som inriktar sig på att maximera antalet besökare på en webbplats som utför en önskad handling, såsom att göra ett köp, registrera sig för ett nyhetsbrev eller fylla i ett kontaktformulär. Genom att fokusera på att förbättra användarupplevelsen och ta bort hinder som kan hindra konvertering, kan företag öka sin effektivitet online och få ut mer av sin befintliga trafik utan att nödvändigtvis öka budgeten för att locka fler besökare. Konverteringsoptimering innebär en systematisk process av testning och analys, där olika element på webbplatsen justeras och optimeras för att öka användarnas engagemang och uppmuntra dem till att genomföra en konvertering. Detta kan inkludera allt från att förfina innehållet, förbättra laddningstiderna, anpassa webbdesign för bättre navigering, till att testa olika call-to-action (CTA) knappar och landningssidor för att se vilka som genererar bäst resultat. A\/B-testning är en populär metod inom konverteringsoptimering som innebär att jämföra två versioner av en webbsida eller ett element för att se vilket som presterar bättre. Genom att använda verktyg för webbanalys kan marknadsförare få insikter om användarbeteende, vilka sidor som presterar bra och vilka som har hög avvisningsfrekvens, vilket möjliggör datadrivna beslut för att förbättra konverteringsfrekvensen. Innovativa projektexempel. Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och webbsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. - - Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. Wängkraft Solcellsrådgivare webbsida och bokningssystem. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och hemsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. Vill du öka dina konverteringar? Kontakta oss så hjälper vi er att komma igång med er digitala marknadsföring. Skicka förfrågan Så här arbetar vi med SEO. 1. Teknisk analys Inledningsvis analyserar vi kundens webbsida noggrant, inkluderar en SEO-teknisk granskning för att identifiera nuvarande position och nödvändiga förbättringar. 2. Sökordsanalys Sedan kartlägger vi sökmöjligheterna för kundens hemsida, dess erbjudanden eller produkter. Vi kompilerar en detaljerad förteckning över nyckelord som är både relevanta och potentiellt lönsamma. 3. On-page optimering Efteråt granskar vi webbplatsens struktur och befintligt material för att skapa en hållbar plan och strategi. Vi bistår med att designa webbplatsen så att den inte bara är användarvänlig, utan också optimerad för sökmotorer. 4. Off-page SEO Backlinks utgör en kritisk komponent för SEO-ranking. Fokuset på extern länkbyggnad, även känt som \"off-page SEO\", förbättrar en webbplats synlighet. Att skaffa relevanta, externa länkar som leder till din webbplats ökar trovärdigheten hos Google. 5. Rapportering och uppföljning Vi övervakar kontinuerligt SEO-resultaten och ger anpassade rapporter om sökordsrankningar, trafik och konverteringar. Genom att ständigt justera baserat på data, ökar vi trafik och konverteringar. Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB envelope-o close arrow-circle-o-down phone flask bars linkedin angle-down code-fork ellipsis-v file-text instagram paint-brush sticky-note","url":"https:\/\/www.weknowit.se\/tjanster\/digital-marknadsforing\/","category":"services"}
{"key":"hosting-forvaltning","text":"Hosting & Förvaltning | Snabb, Säker, Online | We Know IT Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital marknadsföring Hosting & förvaltning Om oss Karriär Kontakta oss Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriar Kontakta oss Hosting & Förvaltning. Låt oss hantera din webbplatsbehov så att du kan koncentrera dig på att skapa värde för dina kunder! Kontakta oss Ett hem för digitala resurser. Välkommen till en hosting- och förvaltningstjänster som garanterar att din webbplats är snabb, säker och alltid online. Vi erbjuder mer än bara tillförlitlig hosting; vår tjänst inkluderar också omfattande förvaltning. Från dagliga säkerhetskontroller till prestandaoptimering och support – vi sköter allt det tekniska. Det ger dig frihet att fokusera på ditt företags tillväxt medan vi ser till att din digitala närvaro är kraftfull och professionell. Låt oss hantera din webbplatsbehov så att du kan koncentrera dig på att skapa värde för dina kunder. Välj oss för en problemfri och effektiv digital närvaro. 01 Hostinglösningar Utforska möjligheterna med skräddarsydda hostinglösningar, utformade för att perfekt möta dina specifika behov. I en tid där din webbplats är en kritisk del av din affärsstrategi, erbjuder vi anpassningsbara hostingalternativ som garanterar pålitlighet och optimerad prestanda för din digitala närvaro. Våra lösningar är noggrant anpassade för att hantera allt från trafikbelastning och säkerhetskrav till skalbarhet och effektiv datahantering, allt för att leverera en överlägsen hostingupplevelse. Vi strävar alltid efter att erbjuda våra kunder den mest prisvärda hostinglösningen som stödjer både dina omedelbara och framtida affärsbehov. Våra lösningar erbjuder en balans mellan prestanda, säkerhet och flexibilitet, och är designade för att ge din webbplats de bästa möjliga förutsättningarna. Upptäck hur en anpassad hosting kan transformera din online-närvaro och främja din affärstillväxt. Välj en hostinglösning som är lika dynamisk och unik som ditt företag. 02 Support & Förvaltning Vår support- och förvaltningstjänst är designad för att hålla din webbplats i toppskick, optimerad för prestanda och skyddad mot säkerhetshot. Genom att erbjuda en integrerad lösning som täcker allt från proaktiv övervakning till kritiska uppdateringar, strävar vi efter att maximera din webbplats tillförlitlighet och tillgänglighet. Vi förstår de tekniska utmaningar som kommer med att driva en framgångsrik online-verksamhet och är här för att erbjuda expertstöd. Vårt mål är att säkerställa att din digitala närvaro är robust, med tjänster som sköter all bakgrundshantering, så att du kan fokusera på det som är viktigt för ditt företag. Vi dedikerar ett team eller enskilda tekniker för att hantera allt från små frågor till större tekniska utmaningar, vi är här för att stödja din tillväxt och säkerställa en smidig drift. Våra förvaltningstjänster är utformade för att erbjuda en balans mellan omfattande support och självständig kontroll, vilket ger dig möjligheten att fokusera på din kärnverksamhet medan vi tar hand om den tekniska sidan. Oavsett om du behöver hjälp med daglig drift, teknisk rådgivning, eller långsiktigt underhåll, kan vår support- och förvaltningstjänst erbjuda en skräddarsydd lösning som passar dina behov. Upptäck hur vi kan bidra till att förstärka din digitala strategi och skapa en mer robust och effektiv online-närvaro för ditt företag. 03 Cloudlösningar För företag med avancerade plattformar och applikationer som kräver en robust infrastruktur, erbjuder vi specialanpassade cloudlösningar genom partnerskap med ledande molnleverantörer som AWS, Google Cloud och Microsoft Azure. Dessa samarbeten tillåter oss att skapa en skräddarsydd molnmiljö som möter de mest komplexa tekniska kraven, och som ger din verksamhet tillgång till en skalbar, säker och högpresterande infrastruktur. Vårt utbud av cloudtjänster är designat för att stödja stora datamängder, hantera hög trafik och leverera oöverträffad prestanda. Genom att dra nytta av molnteknologier från AWS, Google Cloud och Microsoft Azure, kan vi erbjuda avancerade funktioner såsom automatiserad skalbarhet, failover-mekanismer och lastbalansering. Detta säkerställer att din affärskritiska applikation alltid är tillgänglig och presterar på topp, även under de mest krävande förhållandena. Att välja oss som din molnpartner ger dig inte bara tillgång till en kraftfull infrastruktur men även till vår expertis inom optimering och säkerhet i molnet. Vi arbetar tätt tillsammans med dig för att förstå dina unika behov och utmaningar, och utnyttjar vår kunskap om AWS, Google Cloud och Microsoft Azure för att bygga en molnlösning som inte bara möter dagens krav utan även stödjer din framtida tillväxt och innovation. Investera i en cloudlösning som kombinerar det bästa av teknik och expertis. Låt oss hjälpa dig att ta din komplexa plattform eller applikation till nästa nivå med en pålitlig, skalbar och högpresterande molninfrastruktur, drivet av branschledande molnteknologier. 04 Domänhantering I den digitala eran är ditt domännamn mer än bara en adress på internet; det är din identitet, ditt varumärkes första intryck och en kritisk del av din online-närvaro. Vår tjänst för domänhantering är utformad för att ge företag av alla storlekar en sömlös och problemfri erfarenhet när det kommer till att välja, registrera och underhålla sina domännamn. Genom att samarbeta med oss får du tillgång till en omfattande portfölj av toppdomäner (TLDs) från hela världen, vilket ger dig friheten att välja det perfekta domännamnet som bäst reflekterar ditt företag och dess ambitioner. Vår tjänst sträcker sig bortom att hjälpa dig med registrering; vi erbjuder fullständig förvaltning av dina domäner, inklusive förnyelsepåminnelser, säkerhetsskydd och support för domänflytt. Vi förstår vikten av att skydda din digitala egendom, därför inkluderar vår domänhanteringstjänst också avancerade säkerhetsfunktioner som DNSSEC och WHOIS-anonymitet för att säkerställa att dina domäner och den tillhörande informationen är skyddade mot obehörig åtkomst och cyberhot. 05 GDPR & Säkerhet We Know IT är specialiserade på att tillhandahålla skräddarsydda GDPR- och säkerhetstjänster som börjar med en grundläggande analys av ditt företags nuvarande dataskyddspraxis. Vi förstår att varje organisation har unika behov och utmaningar när det kommer till att hantera personuppgifter och säkerställa compliance. Därför arbetar vi nära tillsammans med våra kunder för att utveckla personanpassade lösningar som inte bara uppfyller, utan överträffar GDPR-kraven, samtidigt som vi stärker din övergripande säkerhetsstruktur. Vår expertis sträcker sig bortom den initiala analysen; vi är engagerade i en kontinuerlig process för att hålla oss uppdaterade med de senaste utvecklingarna inom GDPR, inklusive det pågående samarbetet mellan EU och USA kring transatlantisk datahantering. Detta åtagande innebär att vi kan erbjuda rådgivning som speglar de senaste rättsliga ramverken och bästa praxis, vilket ger ditt företag en fördel i att navigera i det komplexa landskapet av internationell dataskyddslagstiftning. We Know IT ser till att ditt företag inte bara uppfyller de grundläggande kraven i GDPR utan även är rustat för att hantera framtida utmaningar och förändringar inom dataskydd och internationell dataöverföring. Genom att välja oss som din partner i GDPR och säkerhet, investerar du i en framtidssäker strategi som skyddar dina kunders data, stärker ditt varumärkes rykte och upprätthåller förtroendet hos dina kunder. Innovativa projektexempel. Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och webbsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. - - Folkes Biluthyrning Digitalisering av biluthyrning med webbsida och integrerat bokningssystem. Boujt Webbsida med chatfunktion med text eller video, inloggning och teckenspråkstolkat innehåll. AI Medical Technology Webbsida med produktinformation om en AI applikation. Världskulturmuseet Webbutveckling av analoga spel på utställningen Världens Spel. Place2place Digital marknadsplats och e-handel för återbrukade kontorsmöbler. Unibail-Rodamco-Westfield Ärendehanteringssystem för fastighetsbolag för snabbare arbetsprocesser. SDUF Webbsida och intranät för Sveriges Dövas Ungdomsförbund. SCALINQ Webbutveckling av webbsida för ett kvantdatorföretag. Vana Webbsida med Google Maps-koppling. Vernivia Webbsida med produktinformation, tester, artiklar och delar som kräver inloggning. Wängkraft Solcellsrådgivare webbsida och bokningssystem. World Hidden Cash Globalt mobilspel med GPS-koppling och möjlighet att tjäna riktiga pengar. GoesArt Ehandel och hemsida för ett välfärdsteknikföretag. Dagligvaruklipp Digital plattform som förmedlar klippartiklar mellan återförsäljare och leverantörer. Företagar Förbundet Mobilapp med artiklar och delar som kräver inloggning. Akademisk kvart Bostadsportal med BankID inloggning. MedFacilis Webbsida för en specialiserad vårdgivare inom hälsa och övervikt. Trygga era digitala resurser! Skippa krånglet med att hålla reda på allt. Låt oss förvalta åt er så får ni mer tid över till er verksamhet. Skicka förfrågan Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB envelope-o close arrow-circle-o-down phone bars linkedin angle-down ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/tjanster\/hosting-forvaltning\/","category":"services"}
{"key":"vernivia-webbutveckling-marknadsforing","text":"Vernivia | Design, Webbutveckling & Marknadsföring Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Vernivia Pharmiva och deras nya produkt Vernivia – en vaginal mousse för behandling av bakteriell vaginos – var i behov av expressivitet och slagkraftighet inför sin lansering hösten 2021. Deras mål var att ta över marknaden och att skapa medvetenhet, bekvämlighet och självförtroende hos kvinnor. Besök Vernivia Webbsida Brief Vernivia var på jakt efter en IT-leverantör som kunde utveckla och administrera deras hemsida samt hjälpa till med sökoptimering och Google Ads inför deras lansering av en helt ny produkt och varumärke. Känslan i den grafiska profilen och den visuella identiteten var extra viktig då produkten kan kännas skamfull bland unga kvinnor. De ville att hemsidan skulle utvecklas i Wordpress för att kunna göra enklare redigering på egen hand och ha en skalbar lösning. Inför uppdraget gjordes en gedigen designbrief, sökordsanalys och omvärldsanalys för att få inspiration och hitta rätt från början. Vi tog fram en strategi för att maximera synligheten på Google och snabbt driva konverteringar och bygga varumärket. Teknologier wordpress php woocommerce google ads google analytics google tag manager elementor Tjänster Webbutveckling UX \/ UI design Sökoptimering Google Ads Leverans Hemsida med anpassade funktionaliteter Löpande marknadsföring We Know IT har med stor flexibilitet och kunnande hjälp oss med allt ifrån design och utveckling av vår nya hemsidan, till SEM & SEO. Det har verkligen varit roligt och givande att jobba med ett så ungt och framåt team! Marie, Brand Manager Vernivia Resultat Resultatet är en väloptimerad hemsida som Vernivias medarbetare enkelt kan administrera över själva. Designen är inspirerad av mod, självförtroende och med kvinnors hälsa i fokus. Idag driver hemsidan trafik som söker både information om ämnet, personal från sjukvården och de som önskar handla produkten. Vi har i etapper vidareutvecklat hemsidan och gjort förändringar i designen i takt med att varumärket växer. Det finns funktionaliteter i form av kontaktformulär, tester, inlogg till specifika delar av hemsidan och blogg bland annat. We Know IT agerar leverantör för både förändringar i utveckling, design och digital marknadsföring. Hittills har vi uppnått framgångsrika resultat och vi ser fram emot att följa med på Vernivias tillväxtresa. Googles startsida 20 sökord Ökad trafik på 6 månader +50% Konverteringsgrad >15% Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/vernivia-webbutveckling-marknadsforing\/","category":"customers"}
{"key":"urw-systemutveckling","text":"Ärendehanteringssystem åt Unibail-Rodamco-Westfield Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Unibail-Rodamco-Westfield Unibail-Rodamco-Westfield är det internationella bolaget som verkar på den svenska marknaden för kommersiella fastigheter. Tidigare sköttes all administration, kommunikation och arbetsberedning kopplat till ombyggnationer via Excel och mail. Idag sker arbetet digitalt, tack vare ett smidigt ärendehanteringssystem kopplat till en webbapp utvecklat av ett team på We Know IT. Webbsida Brief Unibail-Rodamco-Westfield var i behov av ett smidigare ärendehanteringssystem vid ombyggnationer i deras fastigheter. Processerna har många parter inblandade, olika leverantörer lämnar förfrågningar, svarar på frågor och det är mycket material inblandat. Med Excel och långa mailtrådar kunde processerna bli långsamma och mindre effektiva. Vi tog fram ett systemflöde för en lättnavigerad webbapp som kunde göra ärendehanteringen snabbare, smidigare och mer kostnadseffektiv. Målet var att kunna ta in fler förfrågningar, minska tiden för administration och att kunna samla all data på ett och samma ställe. Alla inblandade parter skulle ha bättre möjligheter att snabbt kommunicera och agera för att en ombyggnation ska dra igång och flyta på effektivt. Teknologier react.js bankID autentisering tailwind css node.js firebase docker komponentbibliotek Tjänster Systemutveckling UX \/ UI design Webbutveckling Leverans Hemsida med anpassade funktionaliteter Löpande marknadsföring Som ett steg i arbetet med att digitalisera och utveckla hållbara fastigheter har vi tillsammans med We Know IT skapat en plattform som kan leverera ett effektivt arbetsflöde digitalt med ett användarvänligt gränssnitt för alla parter. Plattformen möjliggör säker och snabb kommunikation, kortare ledtider samt smidig digital administration för att säkerställa effektivitet och transparens i kommande utvecklingsplaner. Jimmy Ekström, Head of PMPS Unibail-Rodamco-Westfield Northern Europe Resultat Vi har utvecklat en webbapp med ett väl kommunicerande system integrerat uppnår de mål vi satte inför uppdraget. Med hjälp av systemet får byggare svara på frågor kopplat till den ombyggnation som ska göras för att skapa en förfrågan. Med loggar som håller koll på flödet, möjlighet att bifoga filer, automatiserad mailkommunikation via Sendgrid och autentisering med BankID via Assently förkortas ledtiderna. Det är enklare att ta in fler förfrågningar och kommunikationen mellan leverantörer och beställare flyter på sömlöst. Eftersom allt sker och lagras digitalt är administrationen och delningen av information enklare. Tillsammans med URW har vi nu ett support- och vidareutvecklingsavtal, samt hanterar hosting av webbapplikationen. System behöver regelbundet uppdateras för att koden och systemet fortsatt ska fungera optimalt. Dessutom finns stora möjligheter att vidareutveckla flera funktioner för ett ännu bättre system som genomförs löpande. Med ett vidareutvecklingsavtal hos oss finns det minst en dedikerad utvecklare samt en projektledare tillgänglig när ett behov uppstår. Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/urw-systemutveckling\/","category":"customers"}
{"key":"place2place-webbutveckling","text":"Kundcase Place2place | Digital Marknadsplats | We Know IT Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Place2Place En idé, vision och dröm. Ola och Daniel, entreprenörerna som grundat Place2Place, kom till oss med sin idé om att skapa den första digitala marknadsplatsen för återbrukade kontorsmöbler. Vi älskar innovativa, bra idéer och tillsammans har vi från 2020 till slutet av 2022 utvecklat och vidareutvecklat visionen till en digital plattform. Besök Place2place E-handel Brief Place2place önskade en visuellt tilltalande hemsida med e-handelsfunktioner. För att få hemsidan till en levande marknadsplats krävdes ett system för att skapa konto, ett system för säljare och ett för köpare. Med ett konto skulle användaren få tillgång till fler funktioner och köpare och säljare skulle kunna göra affärer digitalt. Det efterfrågades också en smidig adminpanel för att ägarna av Place2place enkelt skulle kunna administrera hemsidan på egen hand och sköta dagliga uppdateringar. Som startup behöver man även genomslagskraft för att maximera synligheten och vi fick ta fram en strategi för Google Ads och sökoptimering. Teknologier next.js node.js sql google cloud platform api Tjänster Systemutveckling Webbutveckling UX \/ UI design Google Ads Leverans Design prototyp Responsiv design E-handel Adminpanel Vi utvecklade marknadens första helt cirkulära e-handelsplattform med morgondagens viktigaste kompetens. Det kommer vi fortsätta med. OLA & DANIEL, GRUNDARE AV PLACE2PLACE Resultat Under två år har flera leveranser och versioner av plattformen lanserats och i takt med att Place2place växte behövde deras digitala marknadsplats också göra det. Den initiala plattformen byggdes i Next.js med Strapi som adminpanel och Node.js för backend. I och med stor datahantering används SQL som databas och plattformen hostades på Google Cloud Platform. I takt med vidareutveckling, fler samarbetspartners för Place2place och nya idéer har flera APIer implementerats och integrerats i plattformen, både för unika användare och för hela webbplatsen. Olika avtal har krävt olika system för inloggade konton och We Know IT utvecklade och såg till att det fungerade. Det har också tillkommit en chat på hemsidan och ett smidigt kommunikationssystem som gör köpprocessen effektiv. Parallellt jobbade vi med deras synlighet på Google vilket genererade varumärkesmedvetenhet, trafik och kunder. Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/place2place-webbutveckling\/","category":"customers"}
{"key":"varldskulturmuseet-webbutveckling","text":"Webbutveckling Världskulturmuseet | Kundcase Av We Know IT Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Världskulturmuseet Världskulturmuseet i Göteborg har sin utställning Världens spel från april 2023 till augusti 2024. Utställningen presenterar 4000 år gamla brädspel som möter dagens spelkultur från olika delar av världen. En stor del av utställningen är digital och We Know IT har utvecklat det webbaserade innehållet på utställningen. Besök Världskulturmuseet DIGITALISERING AV SPEL Brief Världskulturmuseet sökte en webb- och IT-leverantör inför hösten och vintern 2022 för deras utställning Världens spel. En stor del av utställningen består av webbaserat innehåll där besökarna kan läsa mer om spelet, se bilder och film samt testa på att spela. Uppdraget innefattade utveckling av 36 sidor till olika fördjupningsskärmar. Det är en digital upplevelse som behöver fungera sömlöst över hela perioden som utställningen pågår där flera tusen besökare förväntas. Världskulturmuseet hade redan mycket innehåll och behövde utvecklare som kunde implementera innehållet i ett gränssnitt för att spela in ljud, visa bilder och filmer, zooma samt spela vissa av spelen. Teknologier react.js webswing j-son filer Tjänster Systemutveckling Webbutveckling Leverans Hemsida med anpassade funktionaliteter Löpande marknadsföring Resultat We Know ITs utvecklarteam utvecklade ett gränssnitt i React.js där allt innehåll blev synligt för besökarna i skärmarna på Världskulturmuseet. De skapade individuella sidor för respektive fördjupningsskärm och skapade mallar som förenklade utvecklingsprocessen. Med hjälp av mallarna kunde vi smidigt ladda upp texter, bild, filmer och ljud, samt dritftsätta allting inför premiären. Spelen möjliggjordes genom att köra dem i en separat webswing server. Gränssnittet är statiskt och består bara av frontendutveckling. Därför lades extra mycket tid på utseendet och detaljer i utvecklingen. Då uppdraget krävde testning på skärmarna på Världskulturmuseet innehöll teamet två utvecklare i Göteborg. We Know IT jobbar till största del på distans, men när uppdragen kräver fysiska möten eller testning löser vi det enkelt med våra konsulter utspridda över hela Sverige. Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/varldskulturmuseet-webbutveckling\/","category":"customers"}
{"key":"kundcase-folkes-biluthyrning","text":"Folkes Biluthyrning | Utveckling Av Hemsida & Bokningssystem Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Folkes Biluthyrning Folkes Biluthyrning har hyrt ut fordon i Lund med omnejd sedan 80-talet. I nästan 40 år fungerade bokning och administration analogt. We Know IT har sedan 2019 digitaliserat verksamheten för att ge gänget på Folkes och deras kunder effektiv och flexibel bokningshantering. Idag jobbar vi tätt tillsammans med löpande utveckling och digital marknadsföring. Besök Folkes Biluthyrning HEMSIDA & BOKNINGSSYSTEM Brief Biluthyrningen sköttes manuellt och den digitala närvaron för Folkes Biluthyrning var låg. De hade insett kraften som finns i det digitala och behövde en ny uppdaterad hemsida, ett nytt smidigare bokningssystem och administrationssystem samt hjälp för att synas bättre digitalt. Vi på We Know IT behövde ta fram systemskisser för processen kring uthyrning av bilar. Skisserna behövde innefatta automatisering av processer, bokningar och kunddata i olika system och databaser. Vi tog också fram en ny användarvänlig design till hemsidan som gjorde vägen till bokning kortare för användaren. Uppdraget med en hemsida och två olika system blev stort och omfattande. Inom plattformarna finns integrationer som förenklar bokningen för kunder och arbetet för bolaget. Samtidigt behövde systemen byggas på ett användarvänligt sätt så att personalen på Folkes biluthyrning enkelt skulle kunna administrera hemsidan och arbetet internt. Teknologier react.js firebase Tjänster Webbutveckling UX \/ UI design Systemutveckling Google Ads Resultat We Know IT har agerat IT-avdelning åt Folkes Biluthyrning och levererat en hemsida, ett bokningssystem och ett internt administrationssystem. Plattformen och systemen är utvecklade i React.js och använder Firebase för hosting, databas och cloudfunktioner. Tack vare digitaliseringen av verksamheten är det administrativa arbetet mer kostnads- och tidseffektivt. Dessutom finns idag mer data över kunder, bokningar och resultat som Folkes biluthyrning kan använda för att få verksamheten att växa ytterligare. De automatiseringar som är utvecklade och integrerade i systemen har också förbättrat och förenklat kommunikationen med kunder, samtidigt som kundkapaciteten blivit högre. Parallellt har vi jobbat med digital marknadsföring i form av Google Ads. Det är en insats som har genererat bättre synlighet, fler kunder och ett starkare varumärke. Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/kundcase-folkes-biluthyrning\/","category":"customers"}
{"key":"kundcase-boujt","text":"Kundcase Boujt | Webbutveckling Med Teckenspråkstolkning Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Boujt Boujt, barn- och ungdomsjour på teckenspråk, ger stöd till döva och hörselskadade utanför skoltid. En viktig del i deras verksamhet är webbaserat stöd genom en text- och videochatt. Den dåvarande lösningen fungerade inte som önskat och vi fick i uppdrag att bygga om och förbättra webbplattformen. Besök Boujt Hemsida Brief De viktigaste funktionerna i Boujts kravspecifikation var en text- och videochatt samt inloggning och adminpanel för syssnare. Syssnare är de stödpersoner som på frivillig basis stöttar barn och unga kring alla möjliga frågor och funderingar som barn kan ha, kopplat till dövhet och livet i allmänhet. Det skulle även finnas en panikknapp för att snabbt kunna lämna hemsidan, en frågelåda som struktureras per automatik, blogg och olika quiz. Designmässigt önskades mycket färg med en lekfullhet som tilltalar den unga målgruppen. Hemsidan behövde vara lättnavigerad för att vara anpassad till flera åldrar och med teckenspråkstolkning. NYCKELORD lekfullhet användarvänligt enkelhet färgglatt Teknologier react.js chakra ui strapi Tjänster Webbutveckling UX \/ UI design Systemutveckling Leverans Hemsida Text- & Videochatt Adminpanel We Know IT överraskade oss med en supersnygg och superenkel hemsida! Vi hade ett annat företag tidigare som var mycket problem. Nu är det problemfritt och det är väldigt givande att samarbeta med ett drivet team som visar att de kan uppfylla vår önskan! Rekommenderas varmt! JIIN, VOLONTÄRSAMORDNARE BOUJT Resultat Vårt konsultteam valde att bygga gränssnittet i React och Chakra UI för att kunna skapa en lekfull, flexibel design med teckenspråks-videos när man hovrar på knapparna. För att Boujt enkelt skulle kunna administrera hemsidan användes Strapi som CMS och varje syssnare fick en egen inloggning med olika behörigheter och en användarguide av oss. Hemsidan fick ett lekfullt uttryck med användarvänlighet i fokus. Designen är tydlig och inbjudande enligt önskemål. Chattfunktionen utvecklades med hjälp av ett API och fungerar sömlöst under chattens öppettider. Tillsammans har vi ett supportavtal där vi vidareutvecklar hemsidan i etapper och ser till att den alltid fungerar som den ska. Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/kundcase-boujt\/","category":"customers"}
{"key":"kundcase-world-hidden-cash","text":"Mobilspelet World Hidden Cash | Spelutveckling Av We Know IT Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt World Hidden Cash Tillsammans med Hidden Cash Limited har vi designat, utvecklat och lanserat en AR spel! World Hidden Cash är det GPS-baserade mobilspelet där du som användare letar efter skatter fyllda med pengar du tjänar in på riktigt. Spelet lanserades i maj 2023 och vi jobbar kontinuerligt vidare med vidareutveckling och global marknadsföring. Besök World Hidden Cash MOBILSPEL Brief Hidden Cash Limited hade en vision om ett mobilspel som skulle kunna spelas världen över. Designen skulle vara inspirerad av klassisk skattjakt, men tydligt visa gator och vägar. Eftersom spelet skulle baseras på GPS behövdes tydliga designkomponenter som hjälper användaren att förstå var hen befinner sig och var skatterna ligger. Skatterna i spelet skulle innehålla olika summor som skulle sparas i användarens profil. När en summa på 15 dollar hittats skulle användaren kunna betala ut det till sig själv via Paypal. Spelet behövde vara enkelt och användarvänligt eftersom det skulle vara tillgängligt över hela världen. NYCKELORD skattjakt robust lättnavigerat vuxet Teknologier Unity C# .NET Adobe Illustrator Tjänster Speldesign Digital Marknadsföring Apputveckling Spelutveckling Leverans Mobilspel Paypal integration Det har varit en fröjd att få arbeta tillsammans med ett så duktigt och engagerat team som We Know IT både kring utveckling och marknadsföring. När problem har uppstått har de analyserats och åtgärdats snabbt och gett en \"lessons learned\" process. Flera kreativa förslag har förbättrat och förändrat vår grafiska profil samt funktioner i applikationen. Det systematiska utvecklingsarbetet var enkelt att följa under möten och på Trello. Leverans skedde på överenskommet leveransdatum inom angivet kostnadsförslag. Annonskampanjerna har varit prisvärda och effektiva. Vi ser fram emot ett fortsatt samarbete! THOMAS, GRUNDARE AV HIDDEN CASH LIMITED Resultat Teamet har bestått av speldesigner och spelutvecklare som designat, utvecklat, testat och lanserat appen. Designen har en robust känsla och är lätt att förstå kopplat till verkligheten med hjälp av Google maps som är integrerat. Skattkistorna sätts ut med hjälp av API:er och har olika randomiserade värden. Värdena kan dock kontrolleras från spelets backend för att framåt kunna skapa unika skatter i marknadsföringssammanhang. Skatterna finansieras genom annonser via Google Admob och Hidden Cash Limited väljer även att skänka en summa för varje öppnad skatt till välgörenhet. Vi har parallellt med utvecklingen även börjat marknadsföra spelet på sociala medier och från lansering kört betalda kampanjer globalt. We Know IT designar, utvecklar och tar fram material till spelet och marknadsföringen, samt sätter strategi, planer och följer upp resultatet. Vi är ett team med Hidden Cash Limited och det är vi väldigt stolta över! Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/kundcase-world-hidden-cash\/","category":"customers"}
{"key":"kundcase-kavlinge-kommun-volontarportal","text":"Volontärportal För Kävlinge Kommun | Uppdrag Av We Know IT Våra kunder Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Konsultuthyrning Webbutveckling Apputveckling UX\/UI-Design Digital marknadsföring Hosting & Förvaltning Cases Våra tjänster Om oss Karriär Kontakta oss Kontakta oss Starta projekt Starta projekt Våra kunder Våra tjänster Konsultuthyrning Webbutveckling Apputveckling Design Digital Marknadsföring Hosting & Förvaltning Om oss Karriär Kontakt Kävlinge Kommun Den hälsofrämjande enheten på Kävlinge kommun hade en utmaning att smidigt samordna kommunens volontärer och de med behov av stöd eller hjälp. Tillsammans har vi designat och utvecklat en digital plattform som möjliggör mer engagemang och tillgänglighet för invånarna. Vi på We Know IT är stolta över att få bidra till digitalisering i offentliga verksamheter! VOLONTÄRPORTAL Brief Kävlinge kommun skulle bygga en volontärportal för att förenkla engagemang och hjälptjänster för de äldre i kommunen, med det långsiktiga målet var att förhindra inträdet i äldrevården. De behövde en webbapp som är enkel att använda och navigera i. Syftet var att volontärer skulle kunna logga in och ta sig an uppdrag, samt att uppdrag enkelt skulle kunna läggas upp. Matchningsprocessen skulle ske sömlöst och likaså kommunikationen. Med användarvänlighet i fokus tog vi fram en design som var tydlig för både användare och administratörer av verktyget. I volontärportalen skulle alla kommuninvånare både kunna ta sig an och lägga upp uppdrag. För ökad säkerhet behövdes en integration med BankID. Varje användare skulle kunna se lediga uppdrag, vilka uppdrag de tagit sig an samt att volontärerna skulle kunna lägga in vilka dagar och tider de finns tillgängliga. Teknologier next.js node.js rest-api postgre sql express.js strapi Tjänster Webbutveckling UX \/ UI design Leverans Volontärportal Adminpanel Bank ID autentisiering We Know IT har verkligen lyckats med att uppfylla våra önskningar om en skräddarsydd volontärportal. Projektgruppen visade på en hög servicegrad med stor förståelse för våra krav, behov och önskemål om funktioner. Utan deras profession, kunskap och snabba omställningar hade inte detta varit möjligt! EBBA, ENHETSCHEF KÄVLINGE KOMMUN Resultat Volontärportalen lanserades i februari 2022 med stor framgång. Tack vare webbapplikationen har de anställda på den hälsofrämjande enheten kunnat spara tid och resurser för rekrytering och arbetssätt. Dessutom kan de idag enklare följa processerna, få en tydlig överblick över verksamheten och nå en större målgrupp. Med hjälp av webbappen kan fler bli volontärer och fler invånare kan få hjälp med både små och stora uppdrag. Kävlinge kommun har som mål att vara Sveriges bästa kommun inom omsorg och förhindra inträdet i hemvården. Genom att få engagerade volontärer som kan hjälpa äldre ska verktyget bidra till enkel användning som passar alla målgrupper. Tillsammans med Kävlinge kommun har vi ett support- och vidareutvecklingsavtal samt hosting. Med hosting hos oss behöver de inte tänka på tekniska aspekter, utan vi ser till att webbappen ligger uppe och att systemet klarar tillräckligt många användare. Genom support och vidareutveckling finns vi tillgängliga för att hantera om buggar uppstår, samt om det finns delar som kan förbättras och läggas till i webbappen. Har du en idé? Berätta mer! Tjänster Menu Konsultuthyrning Webbutveckling Apputveckling UX\/UI - Design Digital Marknadsföring Hosting & Förvaltning close Se mer Menu Kunder Om oss Karriär Kontakt Policy & Cookies close Kontakt hello@weknowit.se +46 (0) 8–194 811 Besök oss Kungsgatan 64 111 22 Stockholm We Know IT är techbolaget som sedan 2008 levererat innovativa plattformar och uppdrag inom utveckling, design och digital marknadsföring. Vi strävar efter långsiktiga samarbeten, leveranser över förväntan och ett agilt arbetssätt och kommunikation. © We Know IT Sweden AB close arrow-circle-o-down linkedin ellipsis-v instagram","url":"https:\/\/www.weknowit.se\/kunder\/kundcase-kavlinge-kommun-volontarportal\/","category":"customers"}
